Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# SettingsLlmThinkingLevelDefault
source: Default
ja_jp: デフォルト (Default)

# SettingsLlmThinkingLevelDisabled
source: Disable
ja_jp: 無効化 (Disable)

# SettingsLlmThinkingLevelLow
source: Low
ja_jp: 低い (Low)

# SettingsLlmThinkingLevelMedium
source: Medium
ja_jp: 中 (Medium)

# SettingsLlmThinkingLevelHigh
source: High
ja_jp: 高い (High)

# SettingsLlmThinkingLevelXHigh
source: X-High
ja_jp: 最高 (X-High)

# SettingsLlmCredential
source: API Key
ja_jp: APIキー

# SettingsLlmApiKeyName
source: API Key
ja_jp: APIキー

# SearchRegexTooltip
source: Regex
ja_jp: 正規表現

# CompareTabPrefix
source: Tab
ja_jp: タブ

# HexViewerTitleFormat
source: [H] {0}
ja_jp: {0} [HEX]

# AgentMcpRemoveTooltip
source: Disable MCP
ja_jp: MCP 選択解除

# AgentMcpApiKeyPlaceholder
source: Enter API Key...
ja_jp: API Key を入力...
